; domain
;; GENERATED FROM domain/box_push_v1.py::DOMAIN_IR by symbolic/pddl_gen.py — DO NOT
;; HAND-EDIT. Regenerate via `python -m symbolic.pddl_gen` (or the regeneration test
;; will fail on any drift between this file and the frozen IR).

(define (domain box-push-skills-v1)
  (:requirements :strips :typing)
  (:types agent box zone - object)

  (:predicates
    (delivered ?x0 - box)
    (different ?x0 - agent ?x1 - agent)
    (discovered ?x0 - box)
    (heavy ?x0 - box)
    (in_pose ?x0 - agent ?x1 - box)
    (light ?x0 - box)
    (pending ?x0 - box)
  )

  (:action cooperate_push
    :parameters (?agent1 - agent ?agent2 - agent ?box - box ?zone - zone)
    :precondition (and (different ?agent1 ?agent2) (heavy ?box) (in_pose ?agent1 ?box) (in_pose ?agent2 ?box) (pending ?box))
    :effect (and (delivered ?box) (not (pending ?box)) (not (in_pose ?agent1 ?box)) (not (in_pose ?agent2 ?box)))
  )

  (:action goto_push_pose
    :parameters (?agent - agent ?box - box ?zone - zone)
    :precondition (and (discovered ?box) (pending ?box))
    :effect (and (in_pose ?agent ?box))
  )

  (:action push
    :parameters (?agent - agent ?box - box ?zone - zone)
    :precondition (and (in_pose ?agent ?box) (light ?box) (pending ?box))
    :effect (and (delivered ?box) (not (pending ?box)) (not (in_pose ?agent ?box)))
  )
)

; problem
;; GENERATED FROM domain/box_push_v1.py::DOMAIN_IR by symbolic/pddl_gen.py — DO NOT
;; HAND-EDIT. Regenerate via `python -m symbolic.pddl_gen` (or the regeneration test
;; will fail on any drift between this file and the frozen IR).

(define (problem box-push-v1-deliver-both)
  (:domain box-push-skills-v1)
  (:objects
    agent_0 agent_1 - agent
    box_0 box_1 - box
    delivery_zone - zone
  )
  (:init
    (different agent_0 agent_1)
    (different agent_1 agent_0)
    (discovered box_0)
    (discovered box_1)
    (heavy box_0)
    (light box_1)
    (pending box_0)
    (pending box_1)
  )
  (:goal (and (delivered box_0) (delivered box_1)))
)

; plan
1. (goto_push_pose agent_0 box_0 delivery_zone)
   added: (in_pose agent_0 box_0)
   goals met: 0 of 2
2. (goto_push_pose agent_0 box_1 delivery_zone)
   added: (in_pose agent_0 box_1)
   goals met: 0 of 2
3. (goto_push_pose agent_1 box_0 delivery_zone)
   added: (in_pose agent_1 box_0)
   goals met: 0 of 2
4. (cooperate_push agent_0 agent_1 box_0 delivery_zone)
   deleted: (pending box_0) (in_pose agent_0 box_0) (in_pose agent_1 box_0)
   added: (delivered box_0)
   goals met: 1 of 2
5. (push agent_0 box_1 delivery_zone)
   deleted: (pending box_1) (in_pose agent_0 box_1)
   added: (delivered box_1)
   goals met: 2 of 2
